app/controllers/mpesas_controller.rb

DELETE FROM "access_tokens" WHERE "access_tokens"."id" = ?  [["id", 12]]
INSERT INTO "access_tokens" ("token", "created_at", "updated_at") VALUES (?, ?, ?)  [["token", "8DvFcQEZ68wEDz2n8xRZAEfqSd8s"], ["created_at", "2023-03-18 20:33:34.701942"], ["updated_at", "2023-03-18 20:33:34.701942"]]
---
    def get_access_token
        res = generate_access_token_request()
        if res.code != 200
            r = generate_access_token_request()
            if res.code != 200
                raise MpesaError('Unable to generate access token')
            end
        end
        body = JSON.parse(res, { symbolize_names: true })
        token = body[:access_token]
        AccessToken.destroy_all()
        AccessToken.create!(token: token)