app/controllers/mpesas_controller.rb

    def get_access_token
        res = generate_access_token_request()
        if res.code != 200
        r = generate_access_token_request()
        if res.code != 200
        raise MpesaError('Unable to generate access token')
        end
        end
        body = JSON.parse(res, { symbolize_names: true })
        token = body[:access_token]
        AccessToken.destroy_all()
        AccessToken.create!(token: token)
---
DELETE FROM "access_tokens" WHERE "access_tokens"."id" = ?  [["id", 16]]
INSERT INTO "access_tokens" ("token", "created_at", "updated_at") VALUES (?, ?, ?)  [["token", "XjghiA2TWVudR9LM7725cgtGwbmA"], ["created_at", "2023-03-18 19:43:59.245165"], ["updated_at", "2023-03-18 19:43:59.245165"]]